from django.shortcuts import render

services = [
    {
        'name': 'Лечение зубов',
        'img': 'tooth.png'
    },
    {
        'name': 'Гигиена',
        'img': 'tooth.png'
    },
    {
        'name': 'Брекеты',
        'img': 'tooth.png'
    },
    {
        'name': 'Детская стоматология',
        'img': 'tooth.png'
    },
    {
        'name': 'Импланты',
        'img': 'tooth.png'
    },
    {
        'name': 'Виниры',
        'img': 'tooth.png'
    },
    {
        'name': 'Коронки',
        'img': 'tooth.png'
    },
    {
        'name': 'Хирургия',
        'img': 'tooth.png'
    },
]


whyWe = [
    {
        'id': 1,
        'title': 'Честные цены, без хитрых уловок',
        'text': 'Фиксируем цены в плане лечения, не повышаем в процессе.'
    },
    {
        'id': 2,
        'title': 'Опытные Врачи',
        'text': 'Врачи постоянно совершенствуются в своей специальности, несмотря на богатый опыт работы.'
    },
    {
        'id': 3,
        'title': 'Комфортные условия',
        'text': 'Уютная обстановка и отзывчивый персонал сделают поход к стоматологу максимально приятным.'
    },
]


specialists = [
    {
        'name': 'Шац Дарья Сергеевна',
        'post': 'Директор, Главный врач, Врач ортодонт',
        'workExp': '11 лет',
    },
    {
        'name': 'Оленина Марина Николаевна',
        'post': 'Зам директора, Врач стоматолог терапевт',
        'workExp': 'более 25 лет',
    },
    {
        'name': 'Лыщиков Павел Анатольевич',
        'post': 'Врач стоматолог-ортопед, хирург-имплантолог',
        'workExp': 'более 15 лет',
    },
    {
        'name': 'Жирнов Дмитрий Александрович',
        'post': 'Врач стоматолог-ортопед, хирург-имплантолог',
        'workExp': 'более 10 лет',
    },
    {
        'name': 'Терушкина Елена Дмитриевна',
        'post': 'Врач стоматолог детский',
        'workExp': 'более 10 лет',
    },
]




def index(request):
    return render(request, 'myapp/index.html', context={'services': services, 'whyWe': whyWe, 'specialists': specialists})
